# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArrayArray..::..Insert Method
ReferenceArrayArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	ReferenceArray item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As ReferenceArray, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	ReferenceArray^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ReferenceArray
index
    Type: System..::..Int32
# See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace